# -*- coding: utf-8 -*-

# -*- coding: utf-8 -*-

import time, os,numpy
import pandas as pd
from openpyxl import load_workbook

path = 'C:\\Users\\19144\\PycharmProjects\\学习\\test_demo\\data\\'


# 往xlsxname里面写数据，screen_elements_list为二维数组
def writedata(xlsxname, screen_elements_list):
    wb = load_workbook(path + xlsxname)
    sheet = wb["Sheet1"]
    i = 1
    j = 0
    for onerowlist in screen_elements_list:
        i = i + 1
        j = 0
        for elementstr in onerowlist:
            sheet[chr(ord("A") + j) + str(i)] = elementstr
            j = j + 1
    while (j):
        sheet.column_dimensions[chr(ord("A") + j - 1)].width = 18
        j = j - 1

    wb.save(path + xlsxname)


# 删除xlsxname里的所有数据，只保留表头（第一行）
def cleandata(xlsxname):
    wb = load_workbook(path + xlsxname)
    sheet = wb["Sheet1"]
    rownum = sheet.max_row
    if (rownum > 1):
        sheet.delete_rows(2, rownum)
    wb.save(path + xlsxname)


# 筛选xlsxname里面的数据，返回筛选后的结果，一个二维数组
# 适用于工单查询界面，和上一个不一样
def ScreenData(xlsxname, *args):
    pd.set_option("display.unicode.ambiguous_as_wide", True)
    pd.set_option("display.unicode.east_asian_width", True)
    dataframe = pd.read_excel(path + xlsxname, usecols=['工单ID', '工单类型', '文件来源', '工单状态', 'AI审核结果', '人工审核结果'], dtype=str)
    # retlist = dataframe.values.tolist()
    # print(retlist)
    for conditionstr in args:
        if (conditionstr == "文本" or conditionstr == "图片" or conditionstr == "视频"):
            dataframe = dataframe[(dataframe.工单类型 == conditionstr)]
        elif (conditionstr == "mht" or conditionstr == "默认"):
            dataframe = dataframe[(dataframe.文件来源 == conditionstr)]
        elif (
                conditionstr == "待审核" or conditionstr == "机器审核完成" or conditionstr == "一级审核完成" or conditionstr == "二级审核完成"):
            dataframe = dataframe[(dataframe.工单状态 == conditionstr)]
        elif (conditionstr == "通过" or conditionstr == "不通过"):
            dataframe = dataframe[(dataframe.人工审核结果 == conditionstr)]
        elif (conditionstr == "AI通过"):
            dataframe = dataframe[(dataframe.AI审核结果 == "通过")]
        elif (conditionstr == "AI不通过"):
            dataframe = dataframe[(dataframe.AI审核结果 == "不通过")]
        else:
            pass

    retlist = dataframe.values.tolist()
    # print(retlist)
    return retlist


# 筛选xlsxname里面的数据，返回筛选后的结果，一个二维数组
# 适用于我的工单界面，和上一个不一样
def ScreenData1(xlsxname, *args):
    pd.set_option("display.unicode.ambiguous_as_wide", True)
    pd.set_option("display.unicode.east_asian_width", True)
    dataframe = pd.read_excel(path + xlsxname, usecols=['工单ID', '工单类型', '文件来源', '工单状态', 'AI审核结果', '人工审核结果'], dtype=str)
    # retlist = dataframe.values.tolist()
    # print(retlist)
    for conditionstr in args:
        if (conditionstr == "文本" or conditionstr == "图片" or conditionstr == "视频"):
            dataframe = dataframe[(dataframe.工单类型 == conditionstr)]
        elif (conditionstr == "mht" or conditionstr == "默认"):
            dataframe = dataframe[(dataframe.文件来源 == conditionstr)]
        elif (conditionstr == "一级审核中" or conditionstr == "二级审核中"):
            dataframe = dataframe[(dataframe.工单状态 == conditionstr)]
        elif (conditionstr == "通过" or conditionstr == "不通过"):
            dataframe = dataframe[(dataframe.人工审核结果 == conditionstr)]
        elif (conditionstr == "AI通过"):
            dataframe = dataframe[(dataframe.AI审核结果 == "通过")]
        elif (conditionstr == "AI不通过"):
            dataframe = dataframe[(dataframe.AI审核结果 == "不通过")]
        else:
            pass

    retlist = dataframe.values.tolist()
    # print(retlist)
    return retlist


if __name__ == "__main__":
    A=[1,2,3,4,5,6]
    del A[3]
    print(A)
    del A[4]
    print(A)







    # screen_elements_list = [['2101151727191208', '文本', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101151037241127', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101151037143680', '图片', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101151034046452', '文本', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101151033541726', '视频', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101151033424529', '视频', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101151008470872', '视频', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101151011045135', '视频', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101151012266298', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101151012362299', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101151012458066', '文本', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101151010545634', '文本', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101151010433369', '文本', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101151008565762', '文本', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101151008375603', '文本', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101141734262144', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734260294', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734269964', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734261874', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734263367', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262427', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734264552', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734263080', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734264816', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734264749', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734261904', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734265854', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734265644', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734269971', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734261668', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734268323', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734263951', '图片', 'mht', '机器审核完成', '不通过', '-'],
    #                         ['2101141734269558', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734269501', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734267181', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734261562', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734268103', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734267306', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734261242', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734263582', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734263376', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734264873', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734260616', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262389', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734266814', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262815', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734264211', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734266924', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734268365', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734265361', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262587', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734261860', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734265537', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734261694', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734269024', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262243', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262347', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734263329', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262980', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262714', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734267751', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262728', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262060', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734268675', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734260071', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734266874', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734267076', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734261130', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734269285', '图片', 'mht', '机器审核完成', '不通过', '-'],
    #                         ['2101141734261560', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734267926', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734269234', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262943', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734263074', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734260444', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734267745', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262856', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734265655', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734263192', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734268488', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734260176', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734268341', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734265041', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262640', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734261360', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734267735', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734269522', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734266834', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734268337', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734266522', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734267140', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734263484', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734266250', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734266170', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734268756', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734260596', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734260861', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734269065', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734265136', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734267173', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734269622', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734260669', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734265718', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734266643', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734265885', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734267468', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734262809', '文本', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734266220', '文本', 'mht', '机器审核完成', '不通过', '-'],
    #                         ['2101141734265594', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734261961', '文本', 'mht', '机器审核完成', '不通过', '-'],
    #                         ['2101141734264253', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734255864', '图片', 'mht', '机器审核完成', '通过', '-'],
    #                         ['2101141734267782', '文本', 'mht', '机器审核完成', '不通过', '-'],
    #                         ['2101141721115326', '图片', '默认', '二级审核完成', '通过', '通过'],
    #                         ['2101141721111768', '图片', '默认', '二级审核完成', '通过', '通过'],
    #                         ['2101141720528733', '图片', '默认', '一级审核完成', '通过', '通过'],
    #                         ['2101141720504809', '视频', '默认', '一级审核完成', '不通过', '通过'],
    #                         ['2101141720460304', '图片', '默认', '一级审核完成', '通过', '通过'],
    #                         ['2101141720455217', '图片', '默认', '一级审核完成', '通过', '通过'],
    #                         ['2101141720459603', '图片', '默认', '一级审核完成', '通过', '通过'],
    #                         ['2101141720453440', '文本', '默认', '一级审核完成', '通过', '通过'],
    #                         ['2101141559058094', '图片', '默认', '一级审核完成', '通过', '通过'],
    #                         ['2101141558468857', '文本', '默认', '一级审核完成', '不通过', '通过'],
    #                         ['2101141556068229', '图片', '默认', '一级审核完成', '通过', '通过'],
    #                         ['2101141555561958', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101141535152578', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101141538581894', '图片', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101141548427776', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101141548527469', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101141535248127', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101141544280735', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101141544476906', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101141548333980', '视频', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101141535081942', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101141544385581', '文本', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101141220068624', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101141217356283', '视频', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101141219574283', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101141214407893', '视频', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101141214318654', '视频', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101141219491091', '文本', '默认', '机器审核完成', '不通过', '-'],
    #                         ['2101131601492914', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101131601291629', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101131557511845', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101131557511536', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101131557504504', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101131556292612', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101131556294353', '图片', '默认', '机器审核完成', '通过', '-'],
    #                         ['2101131556294321', '图片', '默认', '机器审核完成', '通过', '-']]
    # writedata("workorderquery.xlsx", screen_elements_list)
    # cleandata("workorderquery.xlsx")
    # ScreenData("workorderquery.xlsx", "文本", "mht", "AI不通过")
